[
  {
    "title": "ASTA Kicks Off First China Summit",
    "date": "2017-11-09T14:29:34-0500",
    "author": "Newsdesk",
    "content": "<p>The <strong>American Society of Travel Agents (ASTA)</strong> has kicked off its first <strong>ASTA China Summit</strong>.</p> <p>The event began Sunday, November 5, with a pre-fam in <strong>Guizhou</strong> before kicking off in earnest with a welcome dinner and special presentation from Guizhou the evening of November 8. In addition to acting as a destination expo, attendees will get the chance to take part in cultural immersion experiences and develop relationships with suppliers in Guizhou.</p> <p>According to the <strong>U.S. Department of Commerce National Travel and Tourism office</strong>, the Chinese travel market accounts for 29 percent of the market share by trips within the <a href='http://www.travelagentcentral.com/keyword/asia'><strong>Asia</strong></a> region for American travelers, ASTA said. <strong>China</strong> and the U.S have the two largest tourism economies in the world.</p> <p>Additionally, ASTA’s research study, <strong>How America Travels</strong>, indicates that 38 percent of American travelers wish to “see natural sights” as an important reason for leisure travel, and another 34 percent of American travelers to “see historic sights” when they vacation. American travelers want more unique, off the path, experiences.</p> <p>The percentage share of ASTA members agencies’ international sales has been steadily climbing since early 2000s, coinciding with Americans traveling overseas (outside <strong>North America</strong>) increasingly for the past five years, ASTA said. Tours and packages continue to account for a large percentage of travel agency sales, which is why it is so important for ASTA travel agents to have cultural and destination immersion experiences that allow them the ability to create bespoke tours and packages to sell to their clients.</p> <p>In fact, according to ASTA research, over half of <strong>Millennial</strong> travelers (55%) book travel packages. Through the ASTA China Summit, travel agents will learn how to create custom tour packages for prospective clients in the destination. The event will also showcase China’s unique cuisine, cultures and nature.</p> <h2>Related Stories</h2> <p><a href='http://www.travelagentcentral.com/running-your-business/asta-advocacy-defeated-taxes-would-have-cost-62-6-million-yearly'>ASTA: Advocacy Defeated Taxes That Would Have Cost $62.6 Million Yearly</a></p> <p><a href='http://www.travelagentcentral.com/running-your-business/asta-signs-unwto-tourism-code-ethics'>ASTA Signs UNWTO Tourism Code of Ethics</a></p> <p><a href='http://www.travelagentcentral.com/people/asta-s-new-exec-appointments-aim-to-improve-advocacy'>ASTA’s New Exec Appointments Aim to Improve Advocacy</a></p> <p><a href='http://www.travelagentcentral.com/running-your-business/asta-gbta-tsa-modernization-would-reduce-air-travel-delays'>ASTA, GBTA: TSA Modernization Would Reduce Air Travel Delays</a></p> ",
    "summary": "After a pre-event fam trip through Guizhou, the event began in earnest with a welcome dinner November 8. Here’s an inside look. ",
    "url": "http://www.travelagentcentral.com/running-your-business/asta-kicks-off-first-china-summit",
    "type": "article",
    "id": 295886,
    "image": "https://qtxasset.com/styles/breakpoint_xl_880px_w/s3fs/Travel%20Agent%20Central-1510256118/astachinasummit.jpg?ghSUD1TQZgXO4gbctiMZIfdUuDFohA4I&itok=MmfI4MZ3",
    "primaryTaxonomy": "Running Your Business",
    "tags": "Travel Industry Events, Running a Travel Agency, Home-based Travel Agents"
  }
]
